perf/sleep.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Reset
      duration: 20
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 3
    - name: Plain
      duration: 60
      arrivalRate: 3

    

scenarios:
  - name: Sleep (/sleep)
    flow:
      - get:
          url: '/sleep'